<script>
export default {
  name: "about"
}
</script>

<template>
  <div class="container wrap">
    <h1>О нас</h1>

    <img src="/item/item 1.png" alt="Company Image">

    <p>Добро пожаловать на страницу "О нас" нашего мебельного магазина. Мы - команда энтузиастов, влюбленных в мир
      дизайна и уюта. Наш путь начался с желания создать нечто уникальное – место, где каждый клиент сможет найти
      идеальную мебель для своего дома. С горячим вдохновением и стремлением к совершенству, мы развиваемся, чтобы
      предоставить вам лучший опыт покупок мебели.</p>

    <p>Мы гордимся тем, что предлагаем уникальный опыт выбора мебели, который выделяет нас среди других магазинов. Наши
      продукты не только отражают последние тенденции в дизайне интерьера, но и сочетают в себе высокое качество и
      функциональность. Наша мебель создана с любовью к деталям, чтобы ваш дом стал настоящим уютным уголком, полным
      стиля и комфорта.</p>

    <p>Что делает нас особенными? Наша команда опытных профессионалов стремится к идеальному сочетанию элегантности и
      практичности. Мы внимательно следим за тенденциями и рынком, чтобы предоставить вам мебель, которая не только
      соответствует вашим ожиданиям, но и превосходит их. У нас вы найдете уникальные коллекции, которые подчеркнут ваш
      индивидуальный стиль.</p>

    <img src="/item/item 1.png" alt="Company Image">

    <p>Ваше удовлетворение - наш приоритет. Мы ценим каждого клиента и стремимся сделать процесс выбора мебели легким и
      приятным. Наши дружелюбные консультанты всегда готовы помочь вам подобрать идеальные предметы для вашего дома.
      Кроме того, мы предлагаем гибкие условия оплаты и быструю доставку, чтобы сделать ваш опыт покупок максимально
      удобным.</p>

    <p>Выбрав наш мебельный магазин, вы выбираете не просто товар, а целый мир стиля и качества. Позвольте нам воплотить
      ваши мебельные мечты в реальность!</p>

    <p>Для нас важно не только предоставить вам качественную мебель, но и сделать ваше путешествие по миру дизайна
      легким и вдохновляющим. Мы постоянно обновляем наш ассортимент, чтобы отражать последние тенденции и инновации в
      мире интерьерного дизайна. Наш мебельный магазин станет вашим надежным партнером в создании стильного и уютного
      пространства.</p>

    <p>Вместе с тем, мы придаем большое значение экологической устойчивости. Наши материалы подобраны с заботой о
      природе, и мы стремимся минимизировать воздействие на окружающую среду. Таким образом, покупая у нас мебель, вы не
      только заботитесь о своем комфорте, но и о будущем нашей планеты.</p>

    <p>Мы также гордимся нашими индивидуальными заказами. Если у вас есть конкретное видение, мы готовы воплотить его в
      реальность. Наши мастера и дизайнеры работают с вами, чтобы создать мебель, которая полностью соответствует вашим
      потребностям и предпочтениям. Ваш дом - это ваша история, и мы хотим помочь вам рассказать ее через каждую
      деталь.</p>

    <p>Спасибо за то, что выбираете нас. Мы не просто мебельный магазин; мы становимся частью вашего дома, воплощая ваши
      мечты в каждом предмете мебели. Добро пожаловать в мир, где качество встречается с стилем, а удовлетворение
      клиента – нашей главной целью!</p>

    <img src="/item/item 1.png" alt="Company Image">

    <h2>Почему стоит выбрать нас?</h2>
    <ul>
      <li><strong>Широкий ассортимент:</strong> Мы предлагаем разнообразие стилей, от современных трендов до
        классических решений, чтобы вы могли найти идеальную мебель для своего дома.
      </li>
      <li><strong>Качество и долговечность:</strong> Наши изделия изготовлены из высококачественных материалов с учетом
        последних технологий, гарантируя долгий срок службы вашей мебели.
      </li>
      <li><strong>Индивидуальный подход:</strong> Мы ценим вашу уникальность. Наши консультанты и дизайнеры готовы
        работать с вами, чтобы создать мебель, соответствующую вашим вкусам и потребностям.
      </li>
      <li><strong>Экологическая ответственность:</strong> Мы стремимся к устойчивости, используя экологически чистые
        материалы и методы производства для минимизации воздействия на окружающую среду.
      </li>
      <li><strong>Превосходное обслуживание клиентов:</strong> Ваше удовлетворение нашей главной целью. Наши дружелюбные
        консультанты готовы ответить на ваши вопросы и помочь вам сделать правильный выбор.
      </li>
    </ul>


    <img src="/item/item 1.png" alt="Company Image">
  </div>
</template>

<style scoped>

.container {
  max-width: 800px;
  margin: 0 auto;
}

.wrap {
  padding: 20px;
}

h1 {
  color: #333;
  text-align: center;
  margin: 25px 0;
}

img {
  width: 100%;
  height: 350px;
  max-width: 100%;
  margin-top: 20px;
}

p {
  line-height: 1.6;
  margin-bottom: 15px;
}

h2 {
  color: #333;
  margin: 25px 0;
}

ul {
  list-style-type: square;
  margin-left: 20px;
  margin-bottom: 20px;
}

li {
  margin-bottom: 10px;
}

</style>