<script>
export default {
  name: "footer-element",
  data() {
    return {
      showPrivacyPolicyModal: false,
      showCondifModal: false
    }
  },
  methods: {
    close() {
      this.showPrivacyPolicyModal = false;
      this.showCondifModal = false;
    }
  }
}
</script>

<template>
  <footer>
    <div class="content wrap">
      <div class="company">
        <div class="logo">
          <img class="logotype" src="/icons/logo.svg">
        </div>
        <div class="company-item">
          <a class="phone-number" href="tel:+79779282887">+7 (977) 928-28-87</a>
        </div>
      </div>
      <div class="address">
        <h1 class="title-addres">Адреса наших магазинов:</h1>
        <ul>
          <li><a class="maps" target="_blank"
                 href="https://yandex.ru/maps/213/moscow/?ll=37.722472%2C55.586169&mode=whatshere&whatshere%5Bpoint%5D=37.720638%2C55.585574&whatshere%5Bzoom%5D=16.18&z=16.18">МКАД
            24-1 километр, поселок Совхоза имени Ленина (ТЦ Твой Дом)</a></li>
          <li><a class="maps" target="_blank"
                 href="https://yandex.ru/maps/org/roomer/1193382906/?ll=37.658247%2C55.710291&mode=search&sll=37.722472%2C55.586169&sspn=0.027199%2C0.009108&text=%D0%A3%D0%BB.%20%D0%9B%D0%B5%D0%BD%D0%B8%D0%BD%D1%81%D0%BA%D0%B0%D1%8F%20%D0%A1%D0%BB%D0%BE%D0%B1%D0%BE%D0%B4%D0%B0%2C%2026%2C%202%20%D1%8D%D1%82%D0%B0%D0%B6%2C%20%D0%BF%D0%BE%D0%B4%D0%B8%D1%83%D0%BC%20247.1%20%28%D0%A2%D0%A6%20Roomer%29&z=16.18">Ул.
            Ленинская Слобода, 26, 2 этаж, подиум 247.1 (ТЦ Roomer)</a></li>
        </ul>
      </div>
      <div class="about">
        <ul>
          <li @click="this.$router.push('/about')">О нас</li>
          <li @click="showPrivacyPolicyModal = true">Политика конфеденциальности</li>
          <li @click="showCondifModal = true">Пользовательское соглашение</li>
        </ul>
      </div>
      <div class="social-network">
        <ul>
          <li><a class="social" target="_blank" href="https://t.me/mebelDIVI">@mebelDIVI</a></li>
          <li><a class="social" target="_blank" href="https://vk.com/absolut644611">vk.com/absolut644611</a></li>
        </ul>
      </div>

      <div v-if="showPrivacyPolicyModal || showCondifModal" class="modal-overlay">
        <div class="modal">
          <span class="close" @click="close">&times;</span>
          <div>
            <p v-if="showPrivacyPolicyModal">
              Согласие на обработку персональных данных
              Настоящим в соответствии с Федеральным законом № 152-ФЗ «О персональных данных» от 27.07.2006 года Вы
              подтверждаете свое согласие на обработку DIVI.RU персональных данных: сбор, систематизацию, накопление,
              хранение, уточнение (обновление, изменение), использование, передачу третьим лицам и т.д. Обработка
              персональных данных осуществляется в целях эффективного исполнения заказов, договоров и иных обязательств,
              принятых DIVI.RU в качестве обязательных к исполнению перед Вами. Настоящее согласие распространяется
              на следующие Ваши персональные данные: фамилия, имя и отчество, номер контактного телефона, адрес
              электронной почты, страна/город местонахождения, адрес доставки заказа. Срок действия Вашего согласия
              является неограниченным, однако, Вы вправе в любой момент отозвать настоящее согласие, путём направления
              письменного уведомления на адрес: пос.Московский, м.Румянцево, корпус А, 2 вход, 2 этаж, переход А-Б
              DIVI.RU, с пометкой «отзыв согласия на обработку персональных данных». Настоящим Вы также
              подтверждаете, что ознакомлены с Положением об обработке персональных данных.
            </p>
            <div v-if="showCondifModal">
              <p> Настоящее Соглашение определяет условия использования Пользователями материалов и сервисов сайта
                divi.ru (далее — «Сайт»).</p>

              <p>1. Общие условия</p>
              <ul>
                <li>1.1. Использование материалов и сервисов Сайта регулируется нормами действующего законодательства
                  Российской Федерации.
                </li>
                <li>1.2. Настоящее Соглашение является публичной офертой. Получая доступ к материалам Сайта Пользователь
                  считается присоединившимся к настоящему Соглашению.
                </li>
                <li>1.3. Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего
                  Соглашения. Такие изменения вступают в силу по истечении 3 (Трех) дней с момента размещения новой
                  версии
                  Соглашения на сайте. При несогласии Пользователя с внесенными изменениями он обязан отказаться от
                  доступа к Сайту, прекратить использование материалов и сервисов Сайта.
                </li>
                <li>1.4. Цены на товары, представленные на страницах сайта www.rus-hidromek.ru, могут иметь различные
                  цены
                  в зависимости от географического региона продажи. Точную цену уточняйте у оператора.
                </li>
              </ul>
              <p>2. Обязательства Пользователя</p>
              <ul>
                <li>2.1. Пользователь соглашается не предпринимать действий, которые могут рассматриваться как
                  нарушающие
                  российское законодательство или нормы международного права, в том числе в сфере интеллектуальной
                  собственности, авторских и/или смежных правах, а также любых действий, которые приводят или могут
                  привести к нарушению нормальной работы Сайта и сервисов Сайта.
                </li>
                <li>2.2. Использование материалов Сайта без согласия правообладателей не допускается (статья 1270 ГК
                  РФ).
                  Для правомерного использования материалов Сайта необходимо заключение лицензионных договоров
                  (получение
                  лицензий) от Правообладателей.
                </li>
                <li>2.3. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт
                  обязательна (подпункт 1 пункта 1 статьи 1274 ГК РФ).
                </li>
                <li>2.4. Комментарии и иные записи Пользователя на Сайте не должны вступать в противоречие с
                  требованиями
                  законодательства Российской Федерации и общепринятых норм морали и нравственности.
                </li>
                <li>2.5. Пользователь предупрежден о том, что Администрация Сайта не несет ответственности за посещение
                  и
                  использование им внешних ресурсов, ссылки на которые могут содержаться на сайте.
                </li>
                <li>2.6. Пользователь согласен с тем, что Администрация Сайта не несет ответственности и не имеет прямых
                  или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или
                  убытками, связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой
                  регистрации, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо
                  иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки
                  на внешние ресурсы.
                </li>
                <li>2.7. Пользователь принимает положение о том, что все материалы и сервисы Сайта или любая их часть
                  могут сопровождаться рекламой. Пользователь согласен с тем, что Администрация Сайта не несет
                  какой-либо
                  ответственности и не имеет каких-либо обязательств в связи с такой рекламой.
                </li>
              </ul>
              <p>3. Прочие условия</p>
              <ul>
                <li>3.1. Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат
                  разрешению
                  в соответствии с действующим законодательством Российской Федерации.
                </li>
                <li>3.2. Ничто в Соглашении не может пониматься как установление между Пользователем и Администрации
                  Сайта
                  агентских отношений, отношений товарищества, отношений по совместной деятельности, отношений личного
                  найма, либо каких-то иных отношений, прямо не предусмотренных Соглашением.
                </li>
                <li>3.3. Признание судом какого-либо положения Соглашения недействительным или не подлежащим
                  принудительному исполнению не влечет недействительности иных положений Соглашения.
                </li>
                <li>3.4. Бездействие со стороны Администрации Сайта в случае нарушения кем-либо из Пользователей
                  положений
                  Соглашения не лишает Администрацию Сайта права предпринять позднее соответствующие действия в защиту
                  своих интересов и защиту авторских прав на охраняемые в соответствии с законодательством материалы
                  Сайта.
                </li>
              </ul>
              <p>Пользователь подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения и безусловно
                принимает
                их.</p>
            </div>
          </div>
        </div>
      </div>
    </div>

  </footer>
</template>

<style scoped>

.logotype {
  width: 60px;
  height: 60px;
}

.phone-number {
  text-decoration: none;
  color: white;
}

.social {
  color: white;
  text-decoration: none;
}

.social:hover {
  color: #fbffcc;
}

.maps {
  color: white;
  text-decoration: none;
}

.maps:hover {
  color: #fbffcc;
}
footer {
  background: #373f50;
  color: #fff;
  padding: 35px 0;
}

.content {
  display: flex;
  justify-content: space-between;
}

.logo {
  font-size: 25px;
  font-weight: 800;
  cursor: pointer;
}

.logo-item {
  color: #fe696a;
}

.company-item {
  margin-top: 10px;
  cursor: pointer;
}

.title-addres {
  font-size: 20px;
  margin-bottom: 15px;
}

li {
  margin-bottom: 15px;
  cursor: pointer;
}

li:hover {
  color: #fbffcc;
}

.modal-overlay {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background: rgba(0, 0, 0, 0.5);
  display: flex;
  align-items: center;
  justify-content: center;
}

.modal {
  color: #000;
  background: #fff;
  padding: 30px;
  border-radius: 5px;
  max-width: 80%;
  max-height: 80%;
  overflow-y: auto;
  position: relative;
}

.close {
  color: #fff;
  text-align: center;
  position: absolute;
  top: 10px;
  right: 10px;
  cursor: pointer;
}
.modal li:hover {
 color: #000;
 cursor: default;
}
</style>